app/controllers/abesnsis_controller.rb

  def index
    @abesnsis = Abesnsi.all
---
SELECT "abesnsis".* FROM "abesnsis"