app/controllers/ekskuls_controller.rb

  def index
    @ekskuls = Ekskul.all
---
SELECT "ekskuls".* FROM "ekskuls"