app/controllers/gurus_controller.rb

  def index
    @gurus = Guru.all
---
SELECT "gurus".* FROM "gurus"

  def create
    @guru = Guru.new(guru_params)

    respond_to do |format|
      if @guru.save
---
INSERT INTO "gurus" ("agama", "alamat", "birthday", "birthplace", "created_at", "email", "ingat_aku", "nama", "nip", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_guru
      @guru = Guru.find(params[:id])
---
SELECT "gurus".* FROM "gurus" WHERE "gurus"."id" = ? LIMIT 1  [["id", "1"]]