app/controllers/jadwals_controller.rb

SELECT "jadwals".* FROM "jadwals"
---
  def index
    @jadwals = Jadwal.all

INSERT INTO "jadwals" ("created_at", "hari", "jam", "kela_id", "mengajar_id", "tanggal", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @jadwal = Jadwal.new(jadwal_params)

    respond_to do |format|
      if @jadwal.save

SELECT "jadwals".* FROM "jadwals" WHERE "jadwals"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_jadwal
      @jadwal = Jadwal.find(params[:id])