app/controllers/kelas_controller.rb

SELECT "kelas".* FROM "kelas"
---
  def index
    @kelas = Kela.all

INSERT INTO "kelas" ("created_at", "nama", "updated_at", "walikela_id") VALUES (?, ?, ?, ?)  [["created_at", Thu, 21 Nov 2013 10:07:53 UTC +00:00], ["nama", "XI IPA 2"], ["updated_at", Thu, 21 Nov 2013 10:07:53 UTC +00:00], ["walikela_id", 1]]
---
  def create
    @kela = Kela.new(kela_params)

    respond_to do |format|
      if @kela.save

SELECT "kelas".* FROM "kelas" WHERE "kelas"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_kela
      @kela = Kela.find(params[:id])