app/controllers/mapels_controller.rb

  def index
    @mapels = Mapel.all
---
SELECT "mapels".* FROM "mapels"

  def create
    @mapel = Mapel.new(mapel_params)

    respond_to do |format|
      if @mapel.save
---
INSERT INTO "mapels" ("created_at", "kode", "nama", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 21 Nov 2013 11:19:31 UTC +00:00], ["kode", "901"], ["nama", "Matematika"], ["updated_at", Thu, 21 Nov 2013 11:19:31 UTC +00:00]]

    def set_mapel
      @mapel = Mapel.find(params[:id])
---
SELECT "mapels".* FROM "mapels" WHERE "mapels"."id" = ? LIMIT 1  [["id", "1"]]