app/controllers/mengajars_controller.rb

SELECT "mengajars".* FROM "mengajars"
---
  def index
    @mengajars = Mengajar.all

INSERT INTO "mengajars" ("created_at", "guru_id", "mapel_id", "tahun_ajaran", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 21 Nov 2013 11:20:42 UTC +00:00], ["guru_id", 1], ["mapel_id", 1], ["tahun_ajaran", "2013"], ["updated_at", Thu, 21 Nov 2013 11:20:42 UTC +00:00]]
---
  def create
    @mengajar = Mengajar.new(mengajar_params)

    respond_to do |format|
      if @mengajar.save

SELECT "mengajars".* FROM "mengajars" WHERE "mengajars"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_mengajar
      @mengajar = Mengajar.find(params[:id])