app/controllers/orangtuas_controller.rb

  def index
    @orangtuas = Orangtua.all
---
SELECT "orangtuas".* FROM "orangtuas"

  def create
    @orangtua = Orangtua.new(orangtua_params)

    respond_to do |format|
      if @orangtua.save
---
INSERT INTO "orangtuas" ("NIK", "agama", "alamat", "birthday", "birthplace", "created_at", "email", "ingat_aku", "nama", "password_digest", "pekerjaan", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_orangtua
      @orangtua = Orangtua.find(params[:id])
---
SELECT "orangtuas".* FROM "orangtuas" WHERE "orangtuas"."id" = ? LIMIT 1  [["id", "1"]]