app/controllers/sessions_controller.rb

  def create

    user = Guru.find_by_email(params[:sessions][:email])
  if user==nil
    user = Orangtua.find_by_email(params[:sessions][:email])
  end
  if user==nil
    user = Siswa.find_by_email(params[:sessions][:email])
  end
  if user==nil
    user = Admin.find_by_email(params[:sessions][:email])
---
SELECT "gurus".* FROM "gurus" WHERE "gurus"."email" = 'haluan.irsad@gmail.com' LIMIT 1
SELECT "orangtuas".* FROM "orangtuas" WHERE "orangtuas"."email" = 'haluan.irsad@gmail.com' LIMIT 1
SELECT "siswas".* FROM "siswas" WHERE "siswas"."email" = 'haluan.irsad@gmail.com' LIMIT 1
SELECT "admins".* FROM "admins" WHERE "admins"."email" = 'haluan.irsad@gmail.com' LIMIT 1