app/controllers/siswas_controller.rb

SELECT "siswas".* FROM "siswas"
---
  def index
    @siswas = Siswa.all

SELECT "orangtuas".* FROM "orangtuas" WHERE "orangtuas"."nama" = 0 LIMIT 1
SELECT "siswas".* FROM "siswas" WHERE "siswas"."nama" IS NULL LIMIT 1
INSERT INTO "siswas" ("agama", "alamat", "birthday", "birthplace", "created_at", "email", "ingat_aku", "nama", "nis", "orangtua_id", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @temp = Siswa.new(siswa_params)
    id=Orangtua.find_by_nama(@temp.orangtua_id)
    @siswa=@temp
    @siswa.orangtua_id=id

    respond_to do |format|
      if @siswa.save

UPDATE "siswas" SET "password_digest" = ?, "birthday" = ?, "ingat_aku" = ?, "updated_at" = ? WHERE "siswas"."id" = 1  [["password_digest", "$2a$10$6/LMOQZXnFzOWh7Vj4vMs.c.MwLTS/CYuQ63UwSpec0hkF.e.DEG2"], ["birthday", ""], ["ingat_aku", "B9JwP-SQmSwUUhcjnquCaw"], ["updated_at", Thu, 21 Nov 2013 04:11:48 UTC +00:00]]
SELECT "orangtuas".* FROM "orangtuas" WHERE "orangtuas"."nama" IS NULL LIMIT 1
---
  def update

    respond_to do |format|
      if @siswa.update(siswa_params)

        format.json { head :no_content }
        @temp=Orangtua.find_by_nama(@siswa.orangtua_id)

DELETE FROM "siswas" WHERE "siswas"."id" = ?  [["id", 1]]
---
  def destroy
    @siswa.destroy

SELECT "siswas".* FROM "siswas" WHERE "siswas"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_siswa
      @siswa = Siswa.find(params[:id])