app/controllers/walikelas_controller.rb

SELECT "walikelas".* FROM "walikelas"
---
  def index
    @walikelas = Walikela.all

INSERT INTO "walikelas" ("created_at", "guru_id", "kela_id", "tahun_ajaran", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 21 Nov 2013 10:23:19 UTC +00:00], ["guru_id", 1], ["kela_id", 1], ["tahun_ajaran", "2013"], ["updated_at", Thu, 21 Nov 2013 10:23:19 UTC +00:00]]
---
  def create
    @walikela = Walikela.new(walikela_params)

    respond_to do |format|
      if @walikela.save

SELECT "kelas".* FROM "kelas" WHERE "kelas"."id" = ? ORDER BY "kelas"."id" ASC LIMIT 1  [["id", 1]]
SELECT "walikelas".* FROM "walikelas" WHERE "walikelas"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_walikela
      @walikela = Walikela.find(params[:id])